# Background of NoSQL Emergence
## 관계형 데이터베이스의 문제점 
1. 관계형 데이터베이스에서는 데이터베이스와 애플리케이션의 메모리 내 데이터 구조 간의 차이에서 발생하는 Impedence Mismatch가 존재한다. 
2. 데이터베이스를 통합 지점으로 사용하는 대신 데이터베이스를 애플리케이션 내에 캡슐화하고 서비스를 통해 통합하는 방향으로 움직이고 있다.
3. 관계형 데이터베이스는 클러스터 환경에서 효율적으로 작동하도록 설계되지 않았다.
## NoSQL의 특징
1. SQL을 사용하지 않음: SQL을 사용하지 않으며, 일부는 SQL과 유사한 쿼리 언어를 제공한다.
2. 오픈소스: 대부분 오픈소스 프로젝트이며, 비공개 시스템에서도 적용될 수 있다.
3. 클러스터 환경에서 잘 작동함: 대부분 클러스터에서 실행되도록 설계되어 일관성과 분산에 대한 다양한 옵션을 제공한다.
4. 스키마를 사용하지 않음: 데이터베이스 레코드에 자유롭게 필드를 추가할 수 있어 비정형 데이터 처리에 유리하다. 
NoSQL의 가장 중요한 결과는 Polyglot Persistence이다.
